{
  "Navbar": {
    "home": "หน้าแรก",
    "contact": "ติดต่อ"
  },
  "Lang": {
    "en": "EN",
    "th": "TH"
  },
  "Header": {
    "sub": "สวัสดีครับ",
    "title": "ผมชื่อนายฉัตรคุปต์ กลิ่นอุบล",
    "subtitle": "ผมอยากเป็น",
    "and": "และ"
  },
  "Footer": {
    "title": "คุณชอบงานของผมรึเปล่า?",
    "subtitle": "พร้อมที่จะร่วมงานไปด้วยกัน"
  },
  "TabBar": {
    "about": "เกี่ยวกับ",
    "skill": "ทักษะ",
    "certificate": "เกียรติบัตร",
    "resume": "ประวัติย่อ",
    "experience": "ประสบการณ์",
    "contact": "การติดต่อ"
  },
  "About": {
    "aboutTitle": "เกี่ยวกับผม",
    "aboutp": "ผมอยากเป็นนักพัฒนา Font-End เพื่อสร้างเว็บแอปพลิเคชันที่น่าประทับใจและใช้เทคโนโลยีใหม่ๆ เพื่อสร้างเว็บแอปพลิเคชันที่ดีที่สุดสำหรับผู้ใช้ ความฝันสูงสุดของผมตอนนี้คือการเป็นนักพัฒนา Full Stack และตอนนี้แม้ว่าผมจะเรียนจบแล้ว แต่ก็ยังคงเรียนหลักสูตรเพิ่มเติมเพื่อบรรลุความฝันของผม",
    "aboutp1": "จนปัจจุบันผมเคยผ่านการฝึกงานด้าน UX/UI Design และ ได้ทำงานด้าน IT SUPPORT มาก่อนทั้งยังเคยทำงานบริษัทชั่วคราวตำแหน่ง Web Developer และ front-end มาด้วยระยะเวลาไม่นาน",
    "aboutp2": "เงินผมไม่หวังสูงแต่ขอได้ตามมาตรฐาน ขอให้ได้เรียนรู้สิ่งใหม่ๆจากการทำงาน และ สังคมการทำงานเป็นมิตร หวังว่าผมจะได้ร่วมทำงานกับคุณที่กำลังอ่านอยู่ ขอบคุณครับผม"
  },
  "Skill": {
    "skillTitle": "ทักษะ",
    "skillp": "ผมมีทักษะด้านเทคโนโลยีส่วน front-end ที่ทันสมัย ​​รวมถึง framework libraries และภาษาต่างๆ ที่ช่วยสร้างแอปพลิเคชันเว็บแบบ dynamic และตอบสนองได้ดี"
  },
  "Certificate": {
    "certificateTitle": "เกียรติบัตร",
    "certificatep": "ใบเกียรติบัตรนี้แสดงถึงความสำเร็จและความทุ่มเทของผมในด้านการเติบโตและการศึกษาส่วนบุคคล",
    "loadMore": "โหลดเพิ่มเติม"
  },
  "Resume": {
    "resumeTitle": "ประวัติย่อ",
    "resumep": "ผมหวังว่าผลงานนี้จะทำให้คุณทราบถึงทักษะและความสามารถของผม หากคุณสนใจที่จะร่วมงานกับผมหรือมีคำถามเพิ่มเติม โปรดติดต่อผมได้เลย",
    "resumep1": "ในประวัติโดยย่อของผม อาจจะมีข้อมูลบางอย่างที่ไม่ได้เป็นปัจจุบันมากนัก แต่โดยรวมนั้นคือทั้งหมดที่ผมได้ทำผ่านมา แสดงที่อยู่และสถานะโดยรวมของผม ถ้าคุณสนใจติดต่อกลับมาได้ตามที่เขียนในประวัติโดยย่อ หรือไปที่หน้าการติดต่อครับผม"
  },
  "Contact": {
    "contactTitle": "ติดต่อผม",
    "contactp": "หากคุณมีคำถาม ข้อสงสัย ข้อเสนอแนะ หรือความคิดเห็นใด ๆ เกี่ยวกับผลงานของผม ผมยินดีอย่างยิ่งที่จะได้รับฟังจากคุณ พร้อมให้ความช่วยเหลือและให้ข้อมูลอย่างเต็มที่ในทุกขั้นตอน หรือการรับฟังความคิดเห็นเพื่อนำไปปรับปรุงบริการของผมให้ดียิ่งขึ้น",
    "name": "ชื่อ",
    "email": "อีเมล",
    "detail": "ข้อความ",
    "send": "ส่งข้อมูล",
    "locat": "369/10 ตําบลหมากแข้ง อําเภอเมืองอุดรธานี จังหวัดอุดรธานี",
    "phone": "085-855-4668",
    "showmail": "MosT5140@hotmail.com"
  },
  "Experience": {
    "experienceTitle": "ประสบการณ์",
    "experiencep": "ผลงานนี้สะท้อนถึงประสบการณ์จริงจากการลงมือทำและใช้ทักษะที่มีอย่างแท้จริง (บางผลงานอาจจะมีข้อผิดพลาดจากการที่ ฐานข้อมูลหายไป เนืองจากไม่สามารถเก็บฐานข้อมูลไว้ตลอดได้)",
    "e1": "เป็นการนำ portfolio มาทำให้เป็นปัจจุบันในเวอร์ชั่นปี 2025 และจัดเรียงเนื้อหาใหม่ให้เรียบง่าย เข้าใจง่ายมากขึ้นพร้อมลูกเล่นใหม่ๆอย่างการส่งข้อความได้ในเว็บด้วย",
    "e2": "เว็บหน้า front end ตอนช่วงที่ทำงานเขียนหน้าเว็บให้กับบริษัทนึง โดยเป็นการทำตามบรีฟที่ได้รับมา",
    "e3": "เว็บหน้า front end ตอนช่วงที่ทำงานเขียนหน้าเว็บให้กับบริษัทนึง โดยเป็นการทำตามบรีฟที่ได้รับมา",
    "e4": "ลองสร้างเกมตอบคำถามแบบมีการให้คะแนนเมื่อตอบคำถามง่ายๆ",
    "e5": "นี่คือพอร์ตโฟลิโอเก่าของฉันที่ฉันสร้างเมื่อปี 2024 และก่อนที่ฉันจะเริ่มทำงานเพื่อรับประสบการณ์เพิ่มเติม",
    "e6": "นี้เป็น project ที่ใหญ่มากสำหรับผมด้วยการทำเว็บขายของ มีหน้าซื้อของ ระบบล็อกอิน ต่างๆ",
    "e7": "ช่วงเริ่มฝึกออกแบบด้วย figma ผมได้ลองทำ UI APP ของ LineMan เพื่อสำหรับฝึกฝนเรียนรู้ นี้คือการทำออกแบบ UI APP",
    "e8": "ผมอยากลองทำเว็บไซต์ให้การเรียนรู้เรื่องดาว แบบเรียบง่ายและเป็นแบบหนึ่งหน้า จึงได้ลองทำด้วย HTML และมี Responsive",
    "e9": "การสร้างกระทู้สนทนาสามารถทำได้โดยใช้ HTML, CSS, Handlers และ MySQL ขั้นตอนนี้เริ่มต้นด้วยการออกแบบโครงสร้างเว็บเพจโดยใช้ HTML เพื่อเพิ่มแบบฟอร์มสำหรับโพสต์หัวข้อใหม่และส่วนสำหรับแสดงหัวข้อที่มีอยู่ จากนั้นจึงใช้ CSS เพื่อปรับปรุงความน่าสนใจและประสบการณ์การใช้งานของไซต์ Handlers ทำหน้าที่เป็นเครื่องมือสร้างเทมเพลต ซึ่งช่วยให้สามารถแสดงผลหัวข้อที่ดึงมาจากฐานข้อมูล MySQL ได้อย่างไดนามิก ซึ่งจัดเก็บข้อมูล เช่น ชื่อเรื่องและเนื้อหา JavaScript ใช้เพื่ออำนวยความสะดวกในการสื่อสารระหว่างแบบฟอร์มและฐานข้อมูล MySQL ช่วยให้ผู้ใช้สามารถสร้างและอ่านหัวข้อได้อย่างราบรื่นบนเว็บไซต์",
    "e10": "เมื่อผมเห็นเว็บไซต์ครั้งแรก ผมรู้สึกว่ามันไม่เป็นมิตรกับผู้ใช้ ผมจึงออกแบบใหม่ให้เรียบง่ายและเข้าถึงได้",
    "e11": "การสร้างเว็บไซต์แชทโดยใช้ React, Tailwind CSS และ Firebase เป็นวิธีที่ทันสมัยและมีประสิทธิภาพในการสร้างแพลตฟอร์มการสื่อสารแบบเรียลไทม์ React มอบอินเทอร์เฟซผู้ใช้แบบตอบสนองและโต้ตอบได้ ในขณะที่ Tailwind CSS ช่วยให้จัดรูปแบบได้อย่างรวดเร็ว"
  }
}
